MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH100/mcu.h
extern volatile __OFF065bits_t OFF065bits __asm__ ("OFF065") __attribute__((section("sfrs"), address(0xBF810644)));
#define OFF066 OFF066
extern volatile uint32_t   OFF066 __attribute__((section("sfrs"), address(0xBF810648)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF066bits_t;
extern volatile __OFF066bits_t OFF066bits __asm__ ("OFF066") __attribute__((section("sfrs"), address(0xBF810648)));
#define OFF067 OFF067
extern volatile uint32_t   OFF067 __attribute__((section("sfrs"), address(0xBF81064C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF067bits_t;
extern volatile __OFF067bits_t OFF067bits __asm__ ("OFF067") __attribute__((section("sfrs"), address(0xBF81064C)));
#define OFF068 OFF068
extern volatile uint32_t   OFF068 __attribute__((section("sfrs"), address(0xBF810650)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF068bits_t;
extern volatile __OFF068bits_t OFF068bits __asm__ ("OFF068") __attribute__((section("sfrs"), address(0xBF810650)));
#define OFF069 OFF069
extern volatile uint32_t   OFF069 __attribute__((section("sfrs"), address(0xBF810654)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF069bits_t;
extern volatile __OFF069bits_t OFF069bits __asm__ ("OFF069") __attribute__((section("sfrs"), address(0xBF810654)));
#define OFF070 OFF070
extern volatile uint32_t   OFF070 __attribute__((section("sfrs"), address(0xBF810658)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF070bits_t;
extern volatile __OFF070bits_t OFF070bits __asm__ ("OFF070") __attribute__((section("sfrs"), address(0xBF810658)));
#define OFF071 OFF071
extern volatile uint32_t   OFF071 __attribute__((section("sfrs"), address(0xBF81065C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF071bits_t;
extern volatile __OFF071bits_t OFF071bits __asm__ ("OFF071") __attribute__((section("sfrs"), address(0xBF81065C)));
#define OFF072 OFF072
extern volatile uint32_t   OFF072 __attribute__((section("sfrs"), address(0xBF810660)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF072bits_t;
extern volatile __OFF072bits_t OFF072bits __asm__ ("OFF072") __attribute__((section("sfrs"), address(0xBF810660)));
#define OFF073 OFF073
extern volatile uint32_t   OFF073 __attribute__((section("sfrs"), address(0xBF810664)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF073bits_t;
extern volatile __OFF073bits_t OFF073bits __asm__ ("OFF073") __attribute__((section("sfrs"), address(0xBF810664)));
#define OFF074 OFF074
extern volatile uint32_t   OFF074 __attribute__((section("sfrs"), address(0xBF810668)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF074bits_t;
extern volatile __OFF074bits_t OFF074bits __asm__ ("OFF074") __attribute__((section("sfrs"), address(0xBF810668)));
#define OFF075 OFF075
extern volatile uint32_t   OFF075 __attribute__((section("sfrs"), address(0xBF81066C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF075bits_t;
extern volatile __OFF075bits_t OFF075bits __asm__ ("OFF075") __attribute__((section("sfrs"), address(0xBF81066C)));
#define OFF076 OFF076
extern volatile uint32_t   OFF076 __attribute__((section("sfrs"), address(0xBF810670)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF076bits_t;
extern volatile __OFF076bits_t OFF076bits __asm__ ("OFF076") __attribute__((section("sfrs"), address(0xBF810670)));
#define OFF077 OFF077
extern volatile uint32_t   OFF077 __attribute__((section("sfrs"), address(0xBF810674)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF077bits_t;
extern volatile __OFF077bits_t OFF077bits __asm__ ("OFF077") __attribute__((section("sfrs"), address(0xBF810674)));
#define OFF078 OFF078
extern volatile uint32_t   OFF078 __attribute__((section("sfrs"), address(0xBF810678)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF078bits_t;
extern volatile __OFF078bits_t OFF078bits __asm__ ("OFF078") __attribute__((section("sfrs"), address(0xBF810678)));
#define OFF079 OFF079
extern volatile uint32_t   OFF079 __attribute__((section("sfrs"), address(0xBF81067C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF079bits_t;
extern volatile __OFF079bits_t OFF079bits __asm__ ("OFF079") __attribute__((section("sfrs"), address(0xBF81067C)));
#define OFF080 OFF080
extern volatile uint32_t   OFF080 __attribute__((section("sfrs"), address(0xBF810680)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF080bits_t;
extern volatile __OFF080bits_t OFF080bits __asm__ ("OFF080") __attribute__((section("sfrs"), address(0xBF810680)));
#define OFF081 OFF081
extern volatile uint32_t   OFF081 __attribute__((section("sfrs"), address(0xBF810684)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF081bits_t;
extern volatile __OFF081bits_t OFF081bits __asm__ ("OFF081") __attribute__((section("sfrs"), address(0xBF810684)));
#define OFF082 OFF082
extern volatile uint32_t   OFF082 __attribute__((section("sfrs"), address(0xBF810688)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF082bits_t;
extern volatile __OFF082bits_t OFF082bits __asm__ ("OFF082") __attribute__((section("sfrs"), address(0xBF810688)));
#define OFF083 OFF083
extern volatile uint32_t   OFF083 __attribute__((section("sfrs"), address(0xBF81068C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF083bits_t;
extern volatile __OFF083bits_t OFF083bits __asm__ ("OFF083") __attribute__((section("sfrs"), address(0xBF81068C)));
#define OFF084 OFF084
extern volatile uint32_t   OFF084 __attribute__((section("sfrs"), address(0xBF810690)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF084bits_t;
extern volatile __OFF084bits_t OFF084bits __asm__ ("OFF084") __attribute__((section("sfrs"), address(0xBF810690)));
#define OFF085 OFF085
extern volatile uint32_t   OFF085 __attribute__((section("sfrs"), address(0xBF810694)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF085bits_t;
extern volatile __OFF085bits_t OFF085bits __asm__ ("OFF085") __attribute__((section("sfrs"), address(0xBF810694)));
#define OFF086 OFF086
extern volatile uint32_t   OFF086 __attribute__((section("sfrs"), address(0xBF810698)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF086bits_t;
extern volatile __OFF086bits_t OFF086bits __asm__ ("OFF086") __attribute__((section("sfrs"), address(0xBF810698)));
#define OFF087 OFF087
extern volatile uint32_t   OFF087 __attribute__((section("sfrs"), address(0xBF81069C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF087bits_t;
