MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH100/mcu.h
  .extern C1FIFOCI16INV    /* 0xBF88078C */
  .extern C1FIFOCON17      /* 0xBF880790 */
  .extern C1FIFOCON17CLR   /* 0xBF880794 */
  .extern C1FIFOCON17SET   /* 0xBF880798 */
  .extern C1FIFOCON17INV   /* 0xBF88079C */
  .extern C1FIFOINT17      /* 0xBF8807A0 */
  .extern C1FIFOINT17CLR   /* 0xBF8807A4 */
  .extern C1FIFOINT17SET   /* 0xBF8807A8 */
  .extern C1FIFOINT17INV   /* 0xBF8807AC */
  .extern C1FIFOUA17       /* 0xBF8807B0 */
  .extern C1FIFOUA17CLR    /* 0xBF8807B4 */
  .extern C1FIFOUA17SET    /* 0xBF8807B8 */
  .extern C1FIFOUA17INV    /* 0xBF8807BC */
  .extern C1FIFOCI17       /* 0xBF8807C0 */
  .extern C1FIFOCI17CLR    /* 0xBF8807C4 */
  .extern C1FIFOCI17SET    /* 0xBF8807C8 */
  .extern C1FIFOCI17INV    /* 0xBF8807CC */
  .extern C1FIFOCON18      /* 0xBF8807D0 */
  .extern C1FIFOCON18CLR   /* 0xBF8807D4 */
  .extern C1FIFOCON18SET   /* 0xBF8807D8 */
  .extern C1FIFOCON18INV   /* 0xBF8807DC */
  .extern C1FIFOINT18      /* 0xBF8807E0 */
  .extern C1FIFOINT18CLR   /* 0xBF8807E4 */
  .extern C1FIFOINT18SET   /* 0xBF8807E8 */
  .extern C1FIFOINT18INV   /* 0xBF8807EC */
  .extern C1FIFOUA18       /* 0xBF8807F0 */
  .extern C1FIFOUA18CLR    /* 0xBF8807F4 */
  .extern C1FIFOUA18SET    /* 0xBF8807F8 */
  .extern C1FIFOUA18INV    /* 0xBF8807FC */
  .extern C1FIFOCI18       /* 0xBF880800 */
  .extern C1FIFOCI18CLR    /* 0xBF880804 */
  .extern C1FIFOCI18SET    /* 0xBF880808 */
  .extern C1FIFOCI18INV    /* 0xBF88080C */
  .extern C1FIFOCON19      /* 0xBF880810 */
  .extern C1FIFOCON19CLR   /* 0xBF880814 */
  .extern C1FIFOCON19SET   /* 0xBF880818 */
  .extern C1FIFOCON19INV   /* 0xBF88081C */
  .extern C1FIFOINT19      /* 0xBF880820 */
  .extern C1FIFOINT19CLR   /* 0xBF880824 */
  .extern C1FIFOINT19SET   /* 0xBF880828 */
  .extern C1FIFOINT19INV   /* 0xBF88082C */
  .extern C1FIFOUA19       /* 0xBF880830 */
  .extern C1FIFOUA19CLR    /* 0xBF880834 */
  .extern C1FIFOUA19SET    /* 0xBF880838 */
  .extern C1FIFOUA19INV    /* 0xBF88083C */
  .extern C1FIFOCI19       /* 0xBF880840 */
  .extern C1FIFOCI19CLR    /* 0xBF880844 */
  .extern C1FIFOCI19SET    /* 0xBF880848 */
  .extern C1FIFOCI19INV    /* 0xBF88084C */
  .extern C1FIFOCON20      /* 0xBF880850 */
  .extern C1FIFOCON20CLR   /* 0xBF880854 */
  .extern C1FIFOCON20SET   /* 0xBF880858 */
  .extern C1FIFOCON20INV   /* 0xBF88085C */
  .extern C1FIFOINT20      /* 0xBF880860 */
  .extern C1FIFOINT20CLR   /* 0xBF880864 */
  .extern C1FIFOINT20SET   /* 0xBF880868 */
  .extern C1FIFOINT20INV   /* 0xBF88086C */
  .extern C1FIFOUA20       /* 0xBF880870 */
  .extern C1FIFOUA20CLR    /* 0xBF880874 */
  .extern C1FIFOUA20SET    /* 0xBF880878 */
  .extern C1FIFOUA20INV    /* 0xBF88087C */
  .extern C1FIFOCI20       /* 0xBF880880 */
  .extern C1FIFOCI20CLR    /* 0xBF880884 */
  .extern C1FIFOCI20SET    /* 0xBF880888 */
  .extern C1FIFOCI20INV    /* 0xBF88088C */
  .extern C1FIFOCON21      /* 0xBF880890 */
  .extern C1FIFOCON21CLR   /* 0xBF880894 */
  .extern C1FIFOCON21SET   /* 0xBF880898 */
  .extern C1FIFOCON21INV   /* 0xBF88089C */
  .extern C1FIFOINT21      /* 0xBF8808A0 */
  .extern C1FIFOINT21CLR   /* 0xBF8808A4 */
  .extern C1FIFOINT21SET   /* 0xBF8808A8 */
  .extern C1FIFOINT21INV   /* 0xBF8808AC */
  .extern C1FIFOUA21       /* 0xBF8808B0 */
  .extern C1FIFOUA21CLR    /* 0xBF8808B4 */
  .extern C1FIFOUA21SET    /* 0xBF8808B8 */
  .extern C1FIFOUA21INV    /* 0xBF8808BC */
  .extern C1FIFOCI21       /* 0xBF8808C0 */
  .extern C1FIFOCI21CLR    /* 0xBF8808C4 */
  .extern C1FIFOCI21SET    /* 0xBF8808C8 */
  .extern C1FIFOCI21INV    /* 0xBF8808CC */
  .extern C1FIFOCON22      /* 0xBF8808D0 */
  .extern C1FIFOCON22CLR   /* 0xBF8808D4 */
  .extern C1FIFOCON22SET   /* 0xBF8808D8 */
  .extern C1FIFOCON22INV   /* 0xBF8808DC */
  .extern C1FIFOINT22      /* 0xBF8808E0 */
  .extern C1FIFOINT22CLR   /* 0xBF8808E4 */
  .extern C1FIFOINT22SET   /* 0xBF8808E8 */
  .extern C1FIFOINT22INV   /* 0xBF8808EC */
  .extern C1FIFOUA22       /* 0xBF8808F0 */
  .extern C1FIFOUA22CLR    /* 0xBF8808F4 */
  .extern C1FIFOUA22SET    /* 0xBF8808F8 */
  .extern C1FIFOUA22INV    /* 0xBF8808FC */
  .extern C1FIFOCI22       /* 0xBF880900 */
  .extern C1FIFOCI22CLR    /* 0xBF880904 */
  .extern C1FIFOCI22SET    /* 0xBF880908 */
  .extern C1FIFOCI22INV    /* 0xBF88090C */
  .extern C1FIFOCON23      /* 0xBF880910 */
  .extern C1FIFOCON23CLR   /* 0xBF880914 */
  .extern C1FIFOCON23SET   /* 0xBF880918 */
  .extern C1FIFOCON23INV   /* 0xBF88091C */
  .extern C1FIFOINT23      /* 0xBF880920 */
  .extern C1FIFOINT23CLR   /* 0xBF880924 */
  .extern C1FIFOINT23SET   /* 0xBF880928 */
  .extern C1FIFOINT23INV   /* 0xBF88092C */
  .extern C1FIFOUA23       /* 0xBF880930 */
  .extern C1FIFOUA23CLR    /* 0xBF880934 */
  .extern C1FIFOUA23SET    /* 0xBF880938 */
  .extern C1FIFOUA23INV    /* 0xBF88093C */
  .extern C1FIFOCI23       /* 0xBF880940 */
  .extern C1FIFOCI23CLR    /* 0xBF880944 */
  .extern C1FIFOCI23SET    /* 0xBF880948 */
  .extern C1FIFOCI23INV    /* 0xBF88094C */
  .extern C1FIFOCON24      /* 0xBF880950 */
  .extern C1FIFOCON24CLR   /* 0xBF880954 */
  .extern C1FIFOCON24SET   /* 0xBF880958 */
  .extern C1FIFOCON24INV   /* 0xBF88095C */
  .extern C1FIFOINT24      /* 0xBF880960 */
  .extern C1FIFOINT24CLR   /* 0xBF880964 */
  .extern C1FIFOINT24SET   /* 0xBF880968 */
  .extern C1FIFOINT24INV   /* 0xBF88096C */
  .extern C1FIFOUA24       /* 0xBF880970 */
  .extern C1FIFOUA24CLR    /* 0xBF880974 */
  .extern C1FIFOUA24SET    /* 0xBF880978 */
  .extern C1FIFOUA24INV    /* 0xBF88097C */
  .extern C1FIFOCI24       /* 0xBF880980 */
  .extern C1FIFOCI24CLR    /* 0xBF880984 */
  .extern C1FIFOCI24SET    /* 0xBF880988 */
  .extern C1FIFOCI24INV    /* 0xBF88098C */
  .extern C1FIFOCON25      /* 0xBF880990 */
  .extern C1FIFOCON25CLR   /* 0xBF880994 */
  .extern C1FIFOCON25SET   /* 0xBF880998 */
  .extern C1FIFOCON25INV   /* 0xBF88099C */
  .extern C1FIFOINT25      /* 0xBF8809A0 */
  .extern C1FIFOINT25CLR   /* 0xBF8809A4 */
  .extern C1FIFOINT25SET   /* 0xBF8809A8 */
  .extern C1FIFOINT25INV   /* 0xBF8809AC */
  .extern C1FIFOUA25       /* 0xBF8809B0 */
  .extern C1FIFOUA25CLR    /* 0xBF8809B4 */
  .extern C1FIFOUA25SET    /* 0xBF8809B8 */
  .extern C1FIFOUA25INV    /* 0xBF8809BC */
  .extern C1FIFOCI25       /* 0xBF8809C0 */
  .extern C1FIFOCI25CLR    /* 0xBF8809C4 */
  .extern C1FIFOCI25SET    /* 0xBF8809C8 */
  .extern C1FIFOCI25INV    /* 0xBF8809CC */
  .extern C1FIFOCON26      /* 0xBF8809D0 */
  .extern C1FIFOCON26CLR   /* 0xBF8809D4 */
  .extern C1FIFOCON26SET   /* 0xBF8809D8 */
  .extern C1FIFOCON26INV   /* 0xBF8809DC */
  .extern C1FIFOINT26      /* 0xBF8809E0 */
  .extern C1FIFOINT26CLR   /* 0xBF8809E4 */
  .extern C1FIFOINT26SET   /* 0xBF8809E8 */
  .extern C1FIFOINT26INV   /* 0xBF8809EC */
  .extern C1FIFOUA26       /* 0xBF8809F0 */
  .extern C1FIFOUA26CLR    /* 0xBF8809F4 */
  .extern C1FIFOUA26SET    /* 0xBF8809F8 */
  .extern C1FIFOUA26INV    /* 0xBF8809FC */
  .extern C1FIFOCI26       /* 0xBF880A00 */
  .extern C1FIFOCI26CLR    /* 0xBF880A04 */
  .extern C1FIFOCI26SET    /* 0xBF880A08 */
  .extern C1FIFOCI26INV    /* 0xBF880A0C */
  .extern C1FIFOCON27      /* 0xBF880A10 */
  .extern C1FIFOCON27CLR   /* 0xBF880A14 */
  .extern C1FIFOCON27SET   /* 0xBF880A18 */
  .extern C1FIFOCON27INV   /* 0xBF880A1C */
  .extern C1FIFOINT27      /* 0xBF880A20 */
  .extern C1FIFOINT27CLR   /* 0xBF880A24 */
  .extern C1FIFOINT27SET   /* 0xBF880A28 */
  .extern C1FIFOINT27INV   /* 0xBF880A2C */
  .extern C1FIFOUA27       /* 0xBF880A30 */
  .extern C1FIFOUA27CLR    /* 0xBF880A34 */
  .extern C1FIFOUA27SET    /* 0xBF880A38 */
  .extern C1FIFOUA27INV    /* 0xBF880A3C */
  .extern C1FIFOCI27       /* 0xBF880A40 */
  .extern C1FIFOCI27CLR    /* 0xBF880A44 */
  .extern C1FIFOCI27SET    /* 0xBF880A48 */
  .extern C1FIFOCI27INV    /* 0xBF880A4C */
  .extern C1FIFOCON28      /* 0xBF880A50 */
  .extern C1FIFOCON28CLR   /* 0xBF880A54 */
  .extern C1FIFOCON28SET   /* 0xBF880A58 */
  .extern C1FIFOCON28INV   /* 0xBF880A5C */
  .extern C1FIFOINT28      /* 0xBF880A60 */
  .extern C1FIFOINT28CLR   /* 0xBF880A64 */
  .extern C1FIFOINT28SET   /* 0xBF880A68 */
  .extern C1FIFOINT28INV   /* 0xBF880A6C */
  .extern C1FIFOUA28       /* 0xBF880A70 */
  .extern C1FIFOUA28CLR    /* 0xBF880A74 */
  .extern C1FIFOUA28SET    /* 0xBF880A78 */
  .extern C1FIFOUA28INV    /* 0xBF880A7C */
  .extern C1FIFOCI28       /* 0xBF880A80 */
  .extern C1FIFOCI28CLR    /* 0xBF880A84 */
  .extern C1FIFOCI28SET    /* 0xBF880A88 */
  .extern C1FIFOCI28INV    /* 0xBF880A8C */
  .extern C1FIFOCON29      /* 0xBF880A90 */
  .extern C1FIFOCON29CLR   /* 0xBF880A94 */
  .extern C1FIFOCON29SET   /* 0xBF880A98 */
  .extern C1FIFOCON29INV   /* 0xBF880A9C */
  .extern C1FIFOINT29      /* 0xBF880AA0 */
  .extern C1FIFOINT29CLR   /* 0xBF880AA4 */
  .extern C1FIFOINT29SET   /* 0xBF880AA8 */
  .extern C1FIFOINT29INV   /* 0xBF880AAC */
  .extern C1FIFOUA29       /* 0xBF880AB0 */
  .extern C1FIFOUA29CLR    /* 0xBF880AB4 */
  .extern C1FIFOUA29SET    /* 0xBF880AB8 */
  .extern C1FIFOUA29INV    /* 0xBF880ABC */
  .extern C1FIFOCI29       /* 0xBF880AC0 */
  .extern C1FIFOCI29CLR    /* 0xBF880AC4 */
  .extern C1FIFOCI29SET    /* 0xBF880AC8 */
  .extern C1FIFOCI29INV    /* 0xBF880ACC */
  .extern C1FIFOCON30      /* 0xBF880AD0 */
  .extern C1FIFOCON30CLR   /* 0xBF880AD4 */
  .extern C1FIFOCON30SET   /* 0xBF880AD8 */
  .extern C1FIFOCON30INV   /* 0xBF880ADC */
  .extern C1FIFOINT30      /* 0xBF880AE0 */
  .extern C1FIFOINT30CLR   /* 0xBF880AE4 */
  .extern C1FIFOINT30SET   /* 0xBF880AE8 */
  .extern C1FIFOINT30INV   /* 0xBF880AEC */
  .extern C1FIFOUA30       /* 0xBF880AF0 */
  .extern C1FIFOUA30CLR    /* 0xBF880AF4 */
  .extern C1FIFOUA30SET    /* 0xBF880AF8 */
  .extern C1FIFOUA30INV    /* 0xBF880AFC */
  .extern C1FIFOCI30       /* 0xBF880B00 */
  .extern C1FIFOCI30CLR    /* 0xBF880B04 */
  .extern C1FIFOCI30SET    /* 0xBF880B08 */
  .extern C1FIFOCI30INV    /* 0xBF880B0C */
  .extern C1FIFOCON31      /* 0xBF880B10 */
  .extern C1FIFOCON31CLR   /* 0xBF880B14 */
  .extern C1FIFOCON31SET   /* 0xBF880B18 */
  .extern C1FIFOCON31INV   /* 0xBF880B1C */
  .extern C1FIFOINT31      /* 0xBF880B20 */
  .extern C1FIFOINT31CLR   /* 0xBF880B24 */
  .extern C1FIFOINT31SET   /* 0xBF880B28 */
  .extern C1FIFOINT31INV   /* 0xBF880B2C */
  .extern C1FIFOUA31       /* 0xBF880B30 */
  .extern C1FIFOUA31CLR    /* 0xBF880B34 */
  .extern C1FIFOUA31SET    /* 0xBF880B38 */
  .extern C1FIFOUA31INV    /* 0xBF880B3C */
  .extern C1FIFOCI31       /* 0xBF880B40 */
  .extern C1FIFOCI31CLR    /* 0xBF880B44 */
  .extern C1FIFOCI31SET    /* 0xBF880B48 */
  .extern C1FIFOCI31INV    /* 0xBF880B4C */
  .extern C2CON            /* 0xBF881000 */
  .extern C2CONCLR         /* 0xBF881004 */
  .extern C2CONSET         /* 0xBF881008 */
  .extern C2CONINV         /* 0xBF88100C */
  .extern C2CFG            /* 0xBF881010 */
  .extern C2CFGCLR         /* 0xBF881014 */
  .extern C2CFGSET         /* 0xBF881018 */
  .extern C2CFGINV         /* 0xBF88101C */
  .extern C2INT            /* 0xBF881020 */
  .extern C2INTCLR         /* 0xBF881024 */
  .extern C2INTSET         /* 0xBF881028 */
  .extern C2INTINV         /* 0xBF88102C */
  .extern C2VEC            /* 0xBF881030 */
  .extern C2VECCLR         /* 0xBF881034 */
  .extern C2VECSET         /* 0xBF881038 */
  .extern C2VECINV         /* 0xBF88103C */
  .extern C2TREC           /* 0xBF881040 */
  .extern C2TRECCLR        /* 0xBF881044 */
  .extern C2TRECSET        /* 0xBF881048 */
  .extern C2TRECINV        /* 0xBF88104C */
  .extern C2FSTAT          /* 0xBF881050 */
  .extern C2FSTATCLR       /* 0xBF881054 */
  .extern C2FSTATSET       /* 0xBF881058 */
  .extern C2FSTATINV       /* 0xBF88105C */
  .extern C2RXOVF          /* 0xBF881060 */
  .extern C2RXOVFCLR       /* 0xBF881064 */
  .extern C2RXOVFSET       /* 0xBF881068 */
  .extern C2RXOVFINV       /* 0xBF88106C */
  .extern C2TMR            /* 0xBF881070 */
  .extern C2TMRCLR         /* 0xBF881074 */
  .extern C2TMRSET         /* 0xBF881078 */
  .extern C2TMRINV         /* 0xBF88107C */
  .extern C2RXM0           /* 0xBF881080 */
  .extern C2RXM0CLR        /* 0xBF881084 */
  .extern C2RXM0SET        /* 0xBF881088 */
  .extern C2RXM0INV        /* 0xBF88108C */
  .extern C2RXM1           /* 0xBF881090 */
  .extern C2RXM1CLR        /* 0xBF881094 */
  .extern C2RXM1SET        /* 0xBF881098 */
  .extern C2RXM1INV        /* 0xBF88109C */
  .extern C2RXM2           /* 0xBF8810A0 */
  .extern C2RXM2CLR        /* 0xBF8810A4 */
  .extern C2RXM2SET        /* 0xBF8810A8 */
  .extern C2RXM2INV        /* 0xBF8810AC */
  .extern C2RXM3           /* 0xBF8810B0 */
  .extern C2RXM3CLR        /* 0xBF8810B4 */
  .extern C2RXM3SET        /* 0xBF8810B8 */
  .extern C2RXM3INV        /* 0xBF8810BC */
  .extern C2FLTCON0        /* 0xBF8810C0 */
  .extern C2FLTCON0CLR     /* 0xBF8810C4 */
  .extern C2FLTCON0SET     /* 0xBF8810C8 */
  .extern C2FLTCON0INV     /* 0xBF8810CC */
  .extern C2FLTCON1        /* 0xBF8810D0 */
  .extern C2FLTCON1CLR     /* 0xBF8810D4 */
  .extern C2FLTCON1SET     /* 0xBF8810D8 */
  .extern C2FLTCON1INV     /* 0xBF8810DC */
  .extern C2FLTCON2        /* 0xBF8810E0 */
  .extern C2FLTCON2CLR     /* 0xBF8810E4 */
  .extern C2FLTCON2SET     /* 0xBF8810E8 */
  .extern C2FLTCON2INV     /* 0xBF8810EC */
  .extern C2FLTCON3        /* 0xBF8810F0 */
  .extern C2FLTCON3CLR     /* 0xBF8810F4 */
  .extern C2FLTCON3SET     /* 0xBF8810F8 */
  .extern C2FLTCON3INV     /* 0xBF8810FC */
  .extern C2FLTCON4        /* 0xBF881100 */
  .extern C2FLTCON4CLR     /* 0xBF881104 */
  .extern C2FLTCON4SET     /* 0xBF881108 */
  .extern C2FLTCON4INV     /* 0xBF88110C */
  .extern C2FLTCON5        /* 0xBF881110 */
  .extern C2FLTCON5CLR     /* 0xBF881114 */
  .extern C2FLTCON5SET     /* 0xBF881118 */
  .extern C2FLTCON5INV     /* 0xBF88111C */
  .extern C2FLTCON6        /* 0xBF881120 */
  .extern C2FLTCON6CLR     /* 0xBF881124 */
  .extern C2FLTCON6SET     /* 0xBF881128 */
  .extern C2FLTCON6INV     /* 0xBF88112C */
  .extern C2FLTCON7        /* 0xBF881130 */
  .extern C2FLTCON7CLR     /* 0xBF881134 */
  .extern C2FLTCON7SET     /* 0xBF881138 */
  .extern C2FLTCON7INV     /* 0xBF88113C */
  .extern C2RXF0           /* 0xBF881140 */
  .extern C2RXF0CLR        /* 0xBF881144 */
  .extern C2RXF0SET        /* 0xBF881148 */
  .extern C2RXF0INV        /* 0xBF88114C */
  .extern C2RXF1           /* 0xBF881150 */
  .extern C2RXF1CLR        /* 0xBF881154 */
  .extern C2RXF1SET        /* 0xBF881158 */
  .extern C2RXF1INV        /* 0xBF88115C */
  .extern C2RXF2           /* 0xBF881160 */
  .extern C2RXF2CLR        /* 0xBF881164 */
  .extern C2RXF2SET        /* 0xBF881168 */
  .extern C2RXF2INV        /* 0xBF88116C */
  .extern C2RXF3           /* 0xBF881170 */
  .extern C2RXF3CLR        /* 0xBF881174 */
  .extern C2RXF3SET        /* 0xBF881178 */
  .extern C2RXF3INV        /* 0xBF88117C */
  .extern C2RXF4           /* 0xBF881180 */
  .extern C2RXF4CLR        /* 0xBF881184 */
  .extern C2RXF4SET        /* 0xBF881188 */
  .extern C2RXF4INV        /* 0xBF88118C */
  .extern C2RXF5           /* 0xBF881190 */
  .extern C2RXF5CLR        /* 0xBF881194 */
  .extern C2RXF5SET        /* 0xBF881198 */
  .extern C2RXF5INV        /* 0xBF88119C */
  .extern C2RXF6           /* 0xBF8811A0 */
  .extern C2RXF6CLR        /* 0xBF8811A4 */
  .extern C2RXF6SET        /* 0xBF8811A8 */
  .extern C2RXF6INV        /* 0xBF8811AC */
  .extern C2RXF7           /* 0xBF8811B0 */
  .extern C2RXF7CLR        /* 0xBF8811B4 */
  .extern C2RXF7SET        /* 0xBF8811B8 */
  .extern C2RXF7INV        /* 0xBF8811BC */
  .extern C2RXF8           /* 0xBF8811C0 */
  .extern C2RXF8CLR        /* 0xBF8811C4 */
  .extern C2RXF8SET        /* 0xBF8811C8 */
  .extern C2RXF8INV        /* 0xBF8811CC */
  .extern C2RXF9           /* 0xBF8811D0 */
  .extern C2RXF9CLR        /* 0xBF8811D4 */
  .extern C2RXF9SET        /* 0xBF8811D8 */
  .extern C2RXF9INV        /* 0xBF8811DC */
  .extern C2RXF10          /* 0xBF8811E0 */
  .extern C2RXF10CLR       /* 0xBF8811E4 */
  .extern C2RXF10SET       /* 0xBF8811E8 */
  .extern C2RXF10INV       /* 0xBF8811EC */
  .extern C2RXF11          /* 0xBF8811F0 */
  .extern C2RXF11CLR       /* 0xBF8811F4 */
  .extern C2RXF11SET       /* 0xBF8811F8 */
  .extern C2RXF11INV       /* 0xBF8811FC */
  .extern C2RXF12          /* 0xBF881200 */
  .extern C2RXF12CLR       /* 0xBF881204 */
  .extern C2RXF12SET       /* 0xBF881208 */
  .extern C2RXF12INV       /* 0xBF88120C */
  .extern C2RXF13          /* 0xBF881210 */
  .extern C2RXF13CLR       /* 0xBF881214 */
  .extern C2RXF13SET       /* 0xBF881218 */
  .extern C2RXF13INV       /* 0xBF88121C */
  .extern C2RXF14          /* 0xBF881220 */
  .extern C2RXF14CLR       /* 0xBF881224 */
  .extern C2RXF14SET       /* 0xBF881228 */
  .extern C2RXF14INV       /* 0xBF88122C */
  .extern C2RXF15          /* 0xBF881230 */
  .extern C2RXF15CLR       /* 0xBF881234 */
  .extern C2RXF15SET       /* 0xBF881238 */
  .extern C2RXF15INV       /* 0xBF88123C */
  .extern C2RXF16          /* 0xBF881240 */
  .extern C2RXF16CLR       /* 0xBF881244 */
  .extern C2RXF16SET       /* 0xBF881248 */
  .extern C2RXF16INV       /* 0xBF88124C */
  .extern C2RXF17          /* 0xBF881250 */
  .extern C2RXF17CLR       /* 0xBF881254 */
  .extern C2RXF17SET       /* 0xBF881258 */
  .extern C2RXF17INV       /* 0xBF88125C */
  .extern C2RXF18          /* 0xBF881260 */
  .extern C2RXF18CLR       /* 0xBF881264 */
  .extern C2RXF18SET       /* 0xBF881268 */
  .extern C2RXF18INV       /* 0xBF88126C */
  .extern C2RXF19          /* 0xBF881270 */
  .extern C2RXF19CLR       /* 0xBF881274 */
  .extern C2RXF19SET       /* 0xBF881278 */
  .extern C2RXF19INV       /* 0xBF88127C */
  .extern C2RXF20          /* 0xBF881280 */
  .extern C2RXF20CLR       /* 0xBF881284 */
  .extern C2RXF20SET       /* 0xBF881288 */
  .extern C2RXF20INV       /* 0xBF88128C */
  .extern C2RXF21          /* 0xBF881290 */
  .extern C2RXF21CLR       /* 0xBF881294 */
  .extern C2RXF21SET       /* 0xBF881298 */
  .extern C2RXF21INV       /* 0xBF88129C */
  .extern C2RXF22          /* 0xBF8812A0 */
  .extern C2RXF22CLR       /* 0xBF8812A4 */
  .extern C2RXF22SET       /* 0xBF8812A8 */
  .extern C2RXF22INV       /* 0xBF8812AC */
  .extern C2RXF23          /* 0xBF8812B0 */
  .extern C2RXF23CLR       /* 0xBF8812B4 */
  .extern C2RXF23SET       /* 0xBF8812B8 */
  .extern C2RXF23INV       /* 0xBF8812BC */
  .extern C2RXF24          /* 0xBF8812C0 */
  .extern C2RXF24CLR       /* 0xBF8812C4 */
  .extern C2RXF24SET       /* 0xBF8812C8 */
  .extern C2RXF24INV       /* 0xBF8812CC */
  .extern C2RXF25          /* 0xBF8812D0 */
  .extern C2RXF25CLR       /* 0xBF8812D4 */
  .extern C2RXF25SET       /* 0xBF8812D8 */
  .extern C2RXF25INV       /* 0xBF8812DC */
  .extern C2RXF26          /* 0xBF8812E0 */
  .extern C2RXF26CLR       /* 0xBF8812E4 */
  .extern C2RXF26SET       /* 0xBF8812E8 */
  .extern C2RXF26INV       /* 0xBF8812EC */
  .extern C2RXF27          /* 0xBF8812F0 */
  .extern C2RXF27CLR       /* 0xBF8812F4 */
  .extern C2RXF27SET       /* 0xBF8812F8 */
  .extern C2RXF27INV       /* 0xBF8812FC */
  .extern C2RXF28          /* 0xBF881300 */
  .extern C2RXF28CLR       /* 0xBF881304 */
  .extern C2RXF28SET       /* 0xBF881308 */
  .extern C2RXF28INV       /* 0xBF88130C */
  .extern C2RXF29          /* 0xBF881310 */
  .extern C2RXF29CLR       /* 0xBF881314 */
  .extern C2RXF29SET       /* 0xBF881318 */
  .extern C2RXF29INV       /* 0xBF88131C */
  .extern C2RXF30          /* 0xBF881320 */
  .extern C2RXF30CLR       /* 0xBF881324 */
  .extern C2RXF30SET       /* 0xBF881328 */
  .extern C2RXF30INV       /* 0xBF88132C */
  .extern C2RXF31          /* 0xBF881330 */
  .extern C2RXF31CLR       /* 0xBF881334 */
  .extern C2RXF31SET       /* 0xBF881338 */
  .extern C2RXF31INV       /* 0xBF88133C */
  .extern C2FIFOBA         /* 0xBF881340 */
  .extern C2FIFOBACLR      /* 0xBF881344 */
  .extern C2FIFOBASET      /* 0xBF881348 */
  .extern C2FIFOBAINV      /* 0xBF88134C */
  .extern C2FIFOCON0       /* 0xBF881350 */
  .extern C2FIFOCON0CLR    /* 0xBF881354 */
  .extern C2FIFOCON0SET    /* 0xBF881358 */
  .extern C2FIFOCON0INV    /* 0xBF88135C */
  .extern C2FIFOINT0       /* 0xBF881360 */
  .extern C2FIFOINT0CLR    /* 0xBF881364 */
  .extern C2FIFOINT0SET    /* 0xBF881368 */
  .extern C2FIFOINT0INV    /* 0xBF88136C */
  .extern C2FIFOUA0        /* 0xBF881370 */
  .extern C2FIFOUA0CLR     /* 0xBF881374 */
  .extern C2FIFOUA0SET     /* 0xBF881378 */
  .extern C2FIFOUA0INV     /* 0xBF88137C */
  .extern C2FIFOCI0        /* 0xBF881380 */
  .extern C2FIFOCI0CLR     /* 0xBF881384 */
  .extern C2FIFOCI0SET     /* 0xBF881388 */
  .extern C2FIFOCI0INV     /* 0xBF88138C */
  .extern C2FIFOCON1       /* 0xBF881390 */
  .extern C2FIFOCON1CLR    /* 0xBF881394 */
  .extern C2FIFOCON1SET    /* 0xBF881398 */
  .extern C2FIFOCON1INV    /* 0xBF88139C */
  .extern C2FIFOINT1       /* 0xBF8813A0 */
  .extern C2FIFOINT1CLR    /* 0xBF8813A4 */
  .extern C2FIFOINT1SET    /* 0xBF8813A8 */
  .extern C2FIFOINT1INV    /* 0xBF8813AC */
  .extern C2FIFOUA1        /* 0xBF8813B0 */
  .extern C2FIFOUA1CLR     /* 0xBF8813B4 */
  .extern C2FIFOUA1SET     /* 0xBF8813B8 */
  .extern C2FIFOUA1INV     /* 0xBF8813BC */
  .extern C2FIFOCI1        /* 0xBF8813C0 */
  .extern C2FIFOCI1CLR     /* 0xBF8813C4 */
  .extern C2FIFOCI1SET     /* 0xBF8813C8 */
  .extern C2FIFOCI1INV     /* 0xBF8813CC */
  .extern C2FIFOCON2       /* 0xBF8813D0 */
  .extern C2FIFOCON2CLR    /* 0xBF8813D4 */
  .extern C2FIFOCON2SET    /* 0xBF8813D8 */
  .extern C2FIFOCON2INV    /* 0xBF8813DC */
  .extern C2FIFOINT2       /* 0xBF8813E0 */
  .extern C2FIFOINT2CLR    /* 0xBF8813E4 */
  .extern C2FIFOINT2SET    /* 0xBF8813E8 */
  .extern C2FIFOINT2INV    /* 0xBF8813EC */
  .extern C2FIFOUA2        /* 0xBF8813F0 */
  .extern C2FIFOUA2CLR     /* 0xBF8813F4 */
  .extern C2FIFOUA2SET     /* 0xBF8813F8 */
  .extern C2FIFOUA2INV     /* 0xBF8813FC */
  .extern C2FIFOCI2        /* 0xBF881400 */
  .extern C2FIFOCI2CLR     /* 0xBF881404 */
  .extern C2FIFOCI2SET     /* 0xBF881408 */
  .extern C2FIFOCI2INV     /* 0xBF88140C */
  .extern C2FIFOCON3       /* 0xBF881410 */
  .extern C2FIFOCON3CLR    /* 0xBF881414 */
  .extern C2FIFOCON3SET    /* 0xBF881418 */
  .extern C2FIFOCON3INV    /* 0xBF88141C */
  .extern C2FIFOINT3       /* 0xBF881420 */
  .extern C2FIFOINT3CLR    /* 0xBF881424 */
  .extern C2FIFOINT3SET    /* 0xBF881428 */
  .extern C2FIFOINT3INV    /* 0xBF88142C */
  .extern C2FIFOUA3        /* 0xBF881430 */
  .extern C2FIFOUA3CLR     /* 0xBF881434 */
  .extern C2FIFOUA3SET     /* 0xBF881438 */
  .extern C2FIFOUA3INV     /* 0xBF88143C */
  .extern C2FIFOCI3        /* 0xBF881440 */
  .extern C2FIFOCI3CLR     /* 0xBF881444 */
  .extern C2FIFOCI3SET     /* 0xBF881448 */
  .extern C2FIFOCI3INV     /* 0xBF88144C */
  .extern C2FIFOCON4       /* 0xBF881450 */
  .extern C2FIFOCON4CLR    /* 0xBF881454 */
  .extern C2FIFOCON4SET    /* 0xBF881458 */
  .extern C2FIFOCON4INV    /* 0xBF88145C */
  .extern C2FIFOINT4       /* 0xBF881460 */
  .extern C2FIFOINT4CLR    /* 0xBF881464 */
  .extern C2FIFOINT4SET    /* 0xBF881468 */
  .extern C2FIFOINT4INV    /* 0xBF88146C */
  .extern C2FIFOUA4        /* 0xBF881470 */
  .extern C2FIFOUA4CLR     /* 0xBF881474 */
  .extern C2FIFOUA4SET     /* 0xBF881478 */
  .extern C2FIFOUA4INV     /* 0xBF88147C */
  .extern C2FIFOCI4        /* 0xBF881480 */
  .extern C2FIFOCI4CLR     /* 0xBF881484 */
  .extern C2FIFOCI4SET     /* 0xBF881488 */
  .extern C2FIFOCI4INV     /* 0xBF88148C */
  .extern C2FIFOCON5       /* 0xBF881490 */
  .extern C2FIFOCON5CLR    /* 0xBF881494 */
  .extern C2FIFOCON5SET    /* 0xBF881498 */
  .extern C2FIFOCON5INV    /* 0xBF88149C */
  .extern C2FIFOINT5       /* 0xBF8814A0 */
  .extern C2FIFOINT5CLR    /* 0xBF8814A4 */
  .extern C2FIFOINT5SET    /* 0xBF8814A8 */
  .extern C2FIFOINT5INV    /* 0xBF8814AC */
  .extern C2FIFOUA5        /* 0xBF8814B0 */
  .extern C2FIFOUA5CLR     /* 0xBF8814B4 */
  .extern C2FIFOUA5SET     /* 0xBF8814B8 */
  .extern C2FIFOUA5INV     /* 0xBF8814BC */
