MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH100/mcu.h
#define _IPC35_DMA6IS_POSITION                   0x00000000
#define _IPC35_DMA6IS_MASK                       0x00000003
#define _IPC35_DMA6IS_LENGTH                     0x00000002

#define _IPC35_DMA6IP_POSITION                   0x00000002
#define _IPC35_DMA6IP_MASK                       0x0000001C
#define _IPC35_DMA6IP_LENGTH                     0x00000003

#define _IPC35_DMA7IS_POSITION                   0x00000008
#define _IPC35_DMA7IS_MASK                       0x00000300
#define _IPC35_DMA7IS_LENGTH                     0x00000002

#define _IPC35_DMA7IP_POSITION                   0x0000000A
#define _IPC35_DMA7IP_MASK                       0x00001C00
#define _IPC35_DMA7IP_LENGTH                     0x00000003

#define _IPC35_SPI2EIS_POSITION                  0x00000010
#define _IPC35_SPI2EIS_MASK                      0x00030000
#define _IPC35_SPI2EIS_LENGTH                    0x00000002

#define _IPC35_SPI2EIP_POSITION                  0x00000012
#define _IPC35_SPI2EIP_MASK                      0x001C0000
#define _IPC35_SPI2EIP_LENGTH                    0x00000003

#define _IPC35_SPI2RXIS_POSITION                 0x00000018
#define _IPC35_SPI2RXIS_MASK                     0x03000000
#define _IPC35_SPI2RXIS_LENGTH                   0x00000002

#define _IPC35_SPI2RXIP_POSITION                 0x0000001A
#define _IPC35_SPI2RXIP_MASK                     0x1C000000
#define _IPC35_SPI2RXIP_LENGTH                   0x00000003

#define _IPC35_w_POSITION                        0x00000000
#define _IPC35_w_MASK                            0xFFFFFFFF
#define _IPC35_w_LENGTH                          0x00000020

#define _IPC36_SPI2TXIS_POSITION                 0x00000000
#define _IPC36_SPI2TXIS_MASK                     0x00000003
#define _IPC36_SPI2TXIS_LENGTH                   0x00000002

#define _IPC36_SPI2TXIP_POSITION                 0x00000002
#define _IPC36_SPI2TXIP_MASK                     0x0000001C
#define _IPC36_SPI2TXIP_LENGTH                   0x00000003

#define _IPC36_U2EIS_POSITION                    0x00000008
#define _IPC36_U2EIS_MASK                        0x00000300
#define _IPC36_U2EIS_LENGTH                      0x00000002

#define _IPC36_U2EIP_POSITION                    0x0000000A
#define _IPC36_U2EIP_MASK                        0x00001C00
#define _IPC36_U2EIP_LENGTH                      0x00000003

#define _IPC36_U2RXIS_POSITION                   0x00000010
#define _IPC36_U2RXIS_MASK                       0x00030000
#define _IPC36_U2RXIS_LENGTH                     0x00000002

#define _IPC36_U2RXIP_POSITION                   0x00000012
#define _IPC36_U2RXIP_MASK                       0x001C0000
#define _IPC36_U2RXIP_LENGTH                     0x00000003

#define _IPC36_U2TXIS_POSITION                   0x00000018
#define _IPC36_U2TXIS_MASK                       0x03000000
#define _IPC36_U2TXIS_LENGTH                     0x00000002

#define _IPC36_U2TXIP_POSITION                   0x0000001A
#define _IPC36_U2TXIP_MASK                       0x1C000000
#define _IPC36_U2TXIP_LENGTH                     0x00000003

#define _IPC36_w_POSITION                        0x00000000
#define _IPC36_w_MASK                            0xFFFFFFFF
#define _IPC36_w_LENGTH                          0x00000020

#define _IPC37_I2C2BIS_POSITION                  0x00000000
#define _IPC37_I2C2BIS_MASK                      0x00000003
#define _IPC37_I2C2BIS_LENGTH                    0x00000002

#define _IPC37_I2C2BIP_POSITION                  0x00000002
#define _IPC37_I2C2BIP_MASK                      0x0000001C
#define _IPC37_I2C2BIP_LENGTH                    0x00000003

#define _IPC37_I2C2SIS_POSITION                  0x00000008
#define _IPC37_I2C2SIS_MASK                      0x00000300
#define _IPC37_I2C2SIS_LENGTH                    0x00000002

#define _IPC37_I2C2SIP_POSITION                  0x0000000A
#define _IPC37_I2C2SIP_MASK                      0x00001C00
#define _IPC37_I2C2SIP_LENGTH                    0x00000003

#define _IPC37_I2C2MIS_POSITION                  0x00000010
#define _IPC37_I2C2MIS_MASK                      0x00030000
#define _IPC37_I2C2MIS_LENGTH                    0x00000002

#define _IPC37_I2C2MIP_POSITION                  0x00000012
#define _IPC37_I2C2MIP_MASK                      0x001C0000
#define _IPC37_I2C2MIP_LENGTH                    0x00000003

#define _IPC37_CAN1IS_POSITION                   0x00000018
#define _IPC37_CAN1IS_MASK                       0x03000000
#define _IPC37_CAN1IS_LENGTH                     0x00000002

#define _IPC37_CAN1IP_POSITION                   0x0000001A
#define _IPC37_CAN1IP_MASK                       0x1C000000
#define _IPC37_CAN1IP_LENGTH                     0x00000003

#define _IPC37_w_POSITION                        0x00000000
#define _IPC37_w_MASK                            0xFFFFFFFF
#define _IPC37_w_LENGTH                          0x00000020

#define _IPC38_CAN2IS_POSITION                   0x00000000
#define _IPC38_CAN2IS_MASK                       0x00000003
#define _IPC38_CAN2IS_LENGTH                     0x00000002

#define _IPC38_CAN2IP_POSITION                   0x00000002
#define _IPC38_CAN2IP_MASK                       0x0000001C
#define _IPC38_CAN2IP_LENGTH                     0x00000003

#define _IPC38_ETHIS_POSITION                    0x00000008
#define _IPC38_ETHIS_MASK                        0x00000300
#define _IPC38_ETHIS_LENGTH                      0x00000002

#define _IPC38_ETHIP_POSITION                    0x0000000A
#define _IPC38_ETHIP_MASK                        0x00001C00
#define _IPC38_ETHIP_LENGTH                      0x00000003

#define _IPC38_SPI3EIS_POSITION                  0x00000010
#define _IPC38_SPI3EIS_MASK                      0x00030000
#define _IPC38_SPI3EIS_LENGTH                    0x00000002

#define _IPC38_SPI3EIP_POSITION                  0x00000012
#define _IPC38_SPI3EIP_MASK                      0x001C0000
#define _IPC38_SPI3EIP_LENGTH                    0x00000003

#define _IPC38_SPI3RXIS_POSITION                 0x00000018
#define _IPC38_SPI3RXIS_MASK                     0x03000000
#define _IPC38_SPI3RXIS_LENGTH                   0x00000002

#define _IPC38_SPI3RXIP_POSITION                 0x0000001A
#define _IPC38_SPI3RXIP_MASK                     0x1C000000
#define _IPC38_SPI3RXIP_LENGTH                   0x00000003

#define _IPC38_w_POSITION                        0x00000000
#define _IPC38_w_MASK                            0xFFFFFFFF
#define _IPC38_w_LENGTH                          0x00000020

#define _IPC39_SPI3TXIS_POSITION                 0x00000000
#define _IPC39_SPI3TXIS_MASK                     0x00000003
#define _IPC39_SPI3TXIS_LENGTH                   0x00000002

#define _IPC39_SPI3TXIP_POSITION                 0x00000002
#define _IPC39_SPI3TXIP_MASK                     0x0000001C
#define _IPC39_SPI3TXIP_LENGTH                   0x00000003

